from rsa1 import p,q
from math import gcd
from random import randint, choice

# Вычисление n:
n = p*q

# Вычисление фи n по формуле Эйлера: 
fn = (p-1)*(q-1)

# Вычисление открытой экспонентs е:
# e должно быть простое, взаимнопростое с fn и e<fn:
# Список из простых чисел:

simple_e = [17,19,23,29,31,37,41,43,47,53,59,61,67,71,73,79,83,89,97,101,103,107,109,113,127,131,137,139,149,151,157,163,167,173,179,181,191,193,197,199,211,223,227,229,233,239,241,251,257,263,269,271,277,281,283,293,307,311,313,317,331,337,347,349,353,359,367,373,379,383,389,397,401,409,419,421,431,433,439,443,449,457,461,463,467,479,487,491,499,503,509,521,523,541,547,557,563,569,571,577,587,593,599,601,607,613,617,619,631,641,643,647,653,659,661,673,677,683,691,701,709,719,727,733,739,743,751,757,761,769,773,787,797,809,811,821,823,827,829,839,853,857,859,863,877,881,883 ,887,907,911,919,929,937,941,947,953,967,971,977,983,991,997,65537]
 
# Найдем секретный ключ d  мультипликативно обратное к числу e по модулю fn:


justic_e = []
justic_d = []

for e in simple_e:
    if gcd(e,fn) == 1:
        
        if pow((fn+1),1,e) == 0:
            #d = i//f
            dfind = (fn+1)//e
            #print(i,f)
            #return i,f,d
            #justic_i.append(i)
            justic_e.append(e)
            justic_d.append(dfind)

e = justic_e[0]
d = justic_d[0]




